org/holymacs/exwm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Holymacs ~ Consult module</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../holymacs.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Holymacs ~ Consult module</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge6d15c0">Autostart applications</a></li>
</ul>
</div>
</div>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">use-package</span> <span style="color: #37aff6;">exwm</span>
  <span style="color: #3fb83f; font-weight: bold;">:config</span>
  (<span style="color: #00c089; font-weight: bold;">require</span> '<span style="color: #37aff6;">exwm-config</span>)
  (exwm-config-example)
  (<span style="color: #00c089; font-weight: bold;">require</span> '<span style="color: #37aff6;">exwm-randr</span>)
  (exwm-randr-enable)
  (<span style="color: #00c089; font-weight: bold;">setq</span> exwm-workspace-number 2
        exwm-randr-workspace-monitor-plist '(0 <span style="color: #af9fff;">"DP-2"</span> 1 <span style="color: #af9fff;">"eDP-1"</span>))
  (<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">holymacs/xrandr-set-monitors</span> ()
    (start-process-shell-command <span style="color: #af9fff;">"xrandr"</span> nil
                                 <span style="color: #b7a07f; font-style: italic;">;; </span><span style="color: #b7a07f; font-style: italic;">"xrandr --output DP-2 --primary --mode 1920x1080 --pos 0x0 --rotate normal --output eDP-1 --1920x1080 --left-of DP-2"</span>
                                 <span style="color: #af9fff;">"xrandr --output eDP-1 --primary --mode 1920x1080"</span>
                                 ))
  (add-hook 'exwm-randr-screen-change-hook #'holymacs/xrandr-set-monitors)
  (<span style="color: #00c089; font-weight: bold;">require</span> '<span style="color: #37aff6;">exwm-systemtray</span>)
  (exwm-systemtray-enable))
</pre>
</div>

<div id="outline-container-orge6d15c0" class="outline-2">
<h2 id="orge6d15c0">Autostart applications</h2>
<div class="outline-text-2" id="text-orge6d15c0">
<pre class="example" id="orge166783">
nm-applet &amp;
blueman-applet &amp;
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-04-20 Sat 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
